temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/HY3131_Reg.h
/******************************************************************************/
/* Filename:HY3131_REG.h                                                      */
/* HY3131 Register Definitions                                                */
/******************************************************************************/

//SPI Protocol
//Register Address<6:0> left shift 1 bit + Read/Write

//---- Data Register -----------------------------------------------------------
//(1) AD1<23:0>:Register for High Resolution ADC (AD1) output data.
//    Max. value: 7FFFFFh, min. value:800000h.
#define  HY3131_AD1_DATA0  0x00 //AD1<7:0>
#define  HY3131_AD1_DATA1  0x01 //AD1<15:8>
#define  HY3131_AD1_DATA2  0x02 //AD1<23:16>

//(2) AD2<23:0>:Register for High Resolution ADC (AD2) output data.
//    Max. value: 03FFFFh, min.value:FC0000h.
//    AD2<18:0> is effective bit, AD<23:19> and AD<18> is the same.
#define  HY3131_AD2_DATA0  0x03 //AD2<7:0>
#define  HY3131_AD2_DATA1  0x04 //AD2<15:8>
#define  HY3131_AD2_DATA2  0x05 //AD2<23:16>

//(3) LPF<23:0>:Register for Low Pass Filter output data.
//    Max. value: 03FFFFh, min. value: FC0000h.
//    LPF<18:0> is effective bit, LPF<23:19> and LPF<18> is the same.
#define  HY3131_LPF_DATA0  0x06 //LPF<7:0>
#define  HY3131_LPF_DATA1  0x07 //LPF<15:8>
#define  HY3131_LPF_DATA2  0x08 //LPF<23:16>

//(4) RMS<39:0>:Register for RMS Converter output data.
//    Max. value: 1FFFFFFFFFh, min. value:E000000000h.
//    RMS<37:0> is effective bit, RMS<39:38> and RMS<37> is the same.
#define  HY3131_RMS_DATA0  0x09 //RMS<7:0>
#define  HY3131_RMS_DATA1  0x0A //RMS<15:8>
#define  HY3131_RMS_DATA2  0x0B //RMS<23:16>
#define  HY3131_RMS_DATA3  0x0C //RMS<31:24>
#define  HY3131_RMS_DATA4  0x0D //RMS<39:32>

//(5) PKHMAX<23:0>:Register for Peak Hold max. output data.
//    Max. value: 03FFFFh, min. value: FC0000h.
//    PKHMAX<18:0> is effective bit, PKHMAX<23:19> and PKHMAX<18> is the same.
#define  HY3131_PKHMIN0  0x0E //PKHMIN<7:0>
#define  HY3131_PKHMIN1  0x0F //PKHMIN<15:8>
#define  HY3131_PKHMIN2  0x10 //PKHMIN<23:16>

//(6) PKHMIN<23:0>:Register for Peak Hold min. output data.
//    Max. value: 03FFFFh, min. value: FC0000h.
//    PKHMIN<18:0> is effective bit, PKHMIN<23:19> and PKHMIN<18> is the same.
#define  HY3131_PKHMAX0  0x11 //PKHMAX<7:0>
#define  HY3131_PKHMAX1  0x12 //PKHMAX<15:8>
#define  HY3131_PKHMAX2  0x13 //PKHMAX<23:16>

// Comparator
#define  HY3131_CTSTA  0x14
         #define  PCNTI 0x80 //Bit7:CNT Buffer output
         #define  ACPO  0x40 //Bit6:Comparator output
         #define  CMPHO 0x20 //Bit5:Comparator High Output
         #define  CMPLO 0x10 //Bit4:Comparator Low Output
         #define  CTBOV 0x01 //Bit0:CTB<23:0> is Over Flow Flag

//(7) CTC<23:0>:Register for Frequency Counter data.
//    Max. value: FFFFFFh, min. value: 000000h.
#define  HY3131_CTC0  0x15 //CTC<7:0>
#define  HY3131_CTC1  0x16 //CTC<15:8>
#define  HY3131_CTC2  0x17 //CTC<23:16>

//(8) CTB<23:0>:Register for Frequency Counter data.
//    Max. value: FFFFFFh, min. value: 000000h.
#define  HY3131_CTB0  0x18 //CTB<7:0>
#define  HY3131_CTB1  0x19 //CTB<15:8>
#define  HY3131_CTB2  0x1A //CTB<23:16>

//(9) CTA<23:0>:Register for Frequency Counter data.
//    Max. value: FFFFFFh, min. value: 000000h.
#define  HY3131_CTA0  0x1B //CTA<7:0>
#define  HY3131_CTA1  0x1C //CTA<15:8>
#define  HY3131_CTA2  0x1D //CTA<23:16>

//---- Interrupt ---------------------------------------------------------------
#define  HY3131_INTF  0x1E  //INTF : IRQ Event Register
         //When VDD lowers than 1.9V, BORF will be set 1. This bit has neither relative INTEx nor IRQ event.
         #define  BORF  0x80

         //RMSF will be set 1 when RMS event takes place.
         #define  RMSF  0x10

         //LPFF will be set 1 when Low Pass Filter event takes place.
         #define  LPFF  0x08

         //AD1F will be set 1 when AD1 event takes place.
         #define  AD1F  0x04

         //AD2F will be set 1 when AD2 event takes place.
         #define  AD2F  0x02

         //CTF will be set 1 when F requency Counter event takes place.
         #define  CTF   0x01

#define  HY3131_INTE  0x1F  //INTE : IRQ Enable Register
         //IRQ is generated when RMS event takes place. 1=Enable, 0=Disable.
         #define  RMSIE 0x10

         //IRQ is generated when Low Pass Filter event takes place. 1=Enable, 0=Disable.
         #define  LPFIE 0x08

         //IRQ is generated when AD1event takes place. 1=Enable, 0=Disable.
         #define  AD1IE 0x04

         //IRQ is generated when AD2 event takes place. 1=Enable, 0=Disable.
         #define  AD2IE 0x02

         //IRQ is generated when Frequency Counter event takes place. 1=Enable, 0=Disable.
         #define  CTIE  0x01

//---- Config ------------------------------------------------------------------
#define  HY3131_R20  0x20
         //SCMPI<2:0>:Comparator Input
         #define  INCMP_SENSE  0x00
         #define  INCMP_FB     0x20
         #define  INCMP_OP1O   0x40
         #define  INCMP_PB0    0x60
         #define  INCMP_PB1    0x80
         #define  INCMP_RLD    0xA0
         #define  INCMP_PB3    0xC0
         #define  INCMP_PB4    0xE0

         //Register bit that can enable CMPH and CMPL comparator. 1=Enable, 0=Disable.
         #define  ENCMP        0x10

         //Register bit that can Enable CNT Buffer and can select input source of Frequency Counter.
         #define  ENCNTI_PCNTI 0x08 //Frequency Counter Input PCNTI
         #define  ENCNTI_ACPO  0x00 //Frequency Counter Input ACPO

         //Register bit that can Enable CMP Pin Buffer. 1=Enable; 0=Disable.
         #define  ENPCMPO      0x04

         //ENCTR:Register bit that can Enable Frequency Counter. 1=Enable;
         //0=Disable and clear CTA<23:0>,CTB<23:0>, CTC<23:0> and CTBOV as 0.
         #define  ENCTR        0x02

#define  HY3131_R21  0x21
         //SCMPRH<3:0>:Comparator voltage selection
         #define  VRHCMP_VDSC16 0x00
         #define  VRHCMP_VDSC13 0x10
         #define  VRHCMP_VDSC11 0x20
         #define  VRHCMP_VDSC10 0x30
         #define  VRHCMP_VDSC9  0x40
         #define  VRHCMP_VDSC8  0x50
         #define  VRHCMP_VDSC7  0x60
         #define  VRHCMP_PB7    0x70
         #define  VRHCMP_AGNDP6 0x80
         #define  VRHCMP_AGNDP5 0x90
         #define  VRHCMP_AGNDP4 0xA0
         #define  VRHCMP_AGNDP3 0xB0
         #define  VRHCMP_AGNDP2 0xC0
         #define  VRHCMP_AGNDP1 0xD0
         #define  VRHCMP_AGNDP0 0xE0
         #define  VRHCMP_AGNDN1 0xF0

         //SCMPRL<3:0>:Comparator voltage selection
         #define  VRLCMP_VDSC2  0x00
         #define  VRLCMP_VDSC5  0x01
         #define  VRLCMP_VDSC7  0x02
         #define  VRLCMP_VDSC8  0x03
         #define  VRLCMP_VDSC9  0x04
         #define  VRLCMP_VDSC10 0x05
         #define  VRLCMP_VDSC11 0x06
         #define  VRLCMP_PB6    0x07
         #define  VRLCMP_AGNDN6 0x08
         #define  VRLCMP_AGNDN5 0x09
         #define  VRLCMP_AGNDN4 0x0A
         #define  VRLCMP_AGNDN3 0x0B
         #define  VRLCMP_AGNDN2 0x0C
         #define  VRLCMP_AGNDN1 0x0D
         #define  VRLCMP_AGNDP0 0x0E
         #define  VRLCMP_AGNDP1 0x0F

#define  HY3131_R22  0x22
         //AD1OS<2:0>:Register bit that can configure DVOS of zero input voltage.
         #define  DCOS_0       0x00
         #define  DCOS_0p25    0x20
         #define  DCOS_0p5     0x40
         #define  DCOS_0p75    0x60
         //#define  DCOS_0       0x80
         #define  DCOS_n0p25   0xA0
         #define  DCOS_n0p5    0xC0
         #define  DCOS_n0p75   0xE0

         //AD1CHOP<1:0>:Register bit that can configure Chop AD1 input signal,
         // the result is reflected at the output AD1<23:0> of AD1.
         #define  AD1CHOP_VXpVOS 0x00  //VX+VOS
         #define  AD1CHOP_VXnVOS 0x08  //VX-VOS
         #define  AD1CHOP_VX     0x10  //VX
         //#define  AD1CHOP_VX    0x18  //VX

         //AD1OSR<2:0>:Register bit that can configure Over Sampling Ratio (OSR1) of AD1 Comb Filter.
         //AD1 data output rate=FAD1CLK/OSR1. FAD1CLK is the frequency of AD1CLK.
         #define  AD1OSR_256   0x00
         #define  AD1OSR_512   0x01
         #define  AD1OSR_1024  0x02
         #define  AD1OSR_2048  0x03
         #define  AD1OSR_4096  0x04
         #define  AD1OSR_8192  0x05
         #define  AD1OSR_16384 0x06
         #define  AD1OSR_32768 0x07

#define  HY3131_R23  0x23
         //Register bit that can Enable AD1. 1=Enable, 0=Disable and clear AD1<23:0> as 0.
         #define  ENAD1        0x80

         //Register bit that can configure Gin of AD1 reference signal.
         #define  AD1RG_0p333  0x10 //AD1 Reference Gain 0.333
         #define  AD1RG_1p0    0x00 //AD1 Reference Gain 1.0

