temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/HY3131_Reg.h
         //Register bit that can configure whether positive reference signal of AD1 passes through Buffer.1=Enable?F0=Disable.
         #define  AD1RHBUF     0x08

         //Register bit that can configure whether negative reference signal of AD1 passes through Buffer.1=Enable?F0=Disable.
         #define  AD1RLBUF     0x04

         //Register bit that can configure whether positive input signal of AD1 passes through Buffer.1=Enable?F0=Disable.
         #define  AD1IPBUF     0x02

         //Register bit that can configure whether negative input signal of AD1 passes through Buffer.1=Enable?F0=Disable.
         #define  AD1INBUF     0x01

#define  HY3131_R24  0x24
         //SAD1FP<3:0>:Filter Positive Input
         #define  SAD1FP_SENSE 0x00
         #define  SAD1FP_FB    0x10
         #define  SAD1FP_RLU   0x20
         #define  SAD1FP_OP1O  0x30
         #define  SAD1FP_OP2O  0x40
         #define  SAD1FP_VDD   0x50
         #define  SAD1FP_REFO  0x60
         #define  SAD1FP_VREF  0x70
         #define  SAD1FP_PB0   0x80
         #define  SAD1FP_PB1   0x90
         #define  SAD1FP_PB2   0xA0
         #define  SAD1FP_PB3   0xB0
         #define  SAD1FP_PB4   0xC0
         #define  SAD1FP_PB5   0xD0
         #define  SAD1FP_PB6   0xE0
         #define  SAD1FP_PB7   0xF0

         //Register bit SDIO can connect PB<0> and PB<8> pin.
         #define  SDIO         0x08

         //SAD1FN<2:0>:Filter Negative Input
         #define  SAD1FN_SENSE 0x00
         #define  SAD1FN_RLU   0x01
         #define  SAD1FN_VSS   0x02
         #define  SAD1FN_AGND  0x03
         #define  SAD1FN_PB2   0x04
         #define  SAD1FN_PB3   0x05
         #define  SAD1FN_PB4   0x06
         #define  SAD1FN_PB5   0x07

#define  HY3131_R25  0x25
         //AD2IG<1:0>:Register bit that can configure input signal gain of AD2.
         #define  AD2IG_0p5    0x00 //AD2 Input 0.5 Gain
         #define  AD2IG_1p0    0x40 //AD2 Input 1.0 Gain
         #define  AD2IG_1p5    0x80 //AD2 Input 1.5 Gain
         #define  AD2IG_2p0    0xC0 //AD2 Input 2.0 Gain

         //AD1IG<1:0>:Register bit that can configure Gain of AD1 input signal.
         #define  AD1IG_0p9    0x00 //AD1 Input 0.9 Gain
         #define  AD1IG_1p8    0x10 //AD1 Input 1.8 Gain
         #define  AD1IG_2p7    0x20 //AD1 Input 2.7 Gain
         #define  AD1IG_3p6    0x30 //AD1 Input 3.6 Gain

         //SACM<1:0>:Register bit that can select ACM voltage(ACM-VSS).
         #define  SACM_1p2     0x00 //ACM-VSS=1.2V
         #define  SACM_0p9     0x04 //ACM-VSS=0.9V
         #define  SACM_1p5     0x08 //ACM-VSS=1.5V
         #define  SACM_1p125   0x0C //ACM-VSS=1.125V

         //Register bit OPS<2:1> can determine the negative input pin of OPAMP to be OPXN or OPXO pin.
         #define  EnOPS2       0x02 //OP2 Non-Inverting Amplifier
         #define  DisOPS2      0x00 //OP2 Unity-Gain Buffer
         #define  EnOPS1       0x01 //OP1 Non-Inverting Amplifier
         #define  DisOPS1      0x00 //OP1 Unity-Gain Buffer

#define  HY3131_R26  0x26
         //Register bit that can Enable AD2.
         #define  ENAD2        0x80 //1=Enable.
         #define  DisAD2       0x00 //0=Disable and clear AD2<18:0> as 0.

         //Register bit that can Enable Chop input signal of AD2.1=Enable, 0=Disable.
         #define  ENCHOPAD2    0x20

         //Register bit that can configure reference signal gain of AD2.
         #define  AD2RG_1p0    0x00 //1.0
         #define  AD2RG_0p333  0x10 //0.333

         //FSYSCLK is the frequency of SYSCLK; FAD2CLK is the frequency of AD2CLK.
         #define  SAD2CLK_Div2 0x00 //SAD2CLK=0:FAD2CLK=FSYSCLK/2
         #define  SAD2CLK_Div4 0x08 //SAD2CLK=1:FAD2CLK=FSYSCLK/4

         //AD2OSR<2:0>:Register bit that can configure Over Sampling Ratio (OSR2) of AD2 Comb Filter.
         //AD2 data output rate=FAD2CLK/OSR2.
         #define  AD2OSR_32    0x00
         #define  AD2OSR_64    0x01
         #define  AD2OSR_128   0x02
         #define  AD2OSR_256   0x03
         #define  AD2OSR_512   0x04
         #define  AD2OSR_1024  0x05
         //#define  AD2OSR_1024  0x06
         //#define  AD2OSR_1024  0x07

#define  HY3131_R27  0x27
         //SAD2IP<1:0>:The positive input signal of AD2
         #define  SAD2IP_OP1O  0x00
         #define  SAD2IP_OP2O  0x40
         #define  SAD2IP_PB4   0x80
         #define  SAD2IP_PB7   0xC0

         //SAD2IN<1:0>:The negative input signal of AD2
         #define  SAD2IN_RLU   0x00
         #define  SAD2IN_AGND  0x10
         #define  SAD2IN_PB3   0x20
         #define  SAD2IN_PB5   0x30

         //SAD2RH<1:0>:The positive reference signal of AD2
         #define  SAD2RH_FB    0x00
         #define  SAD2RH_REFO  0x04
         #define  SAD2RH_VREF  0x08
         #define  SAD2RH_PB6   0x0C

         //SAD2RL<1:0>:The negative reference signal of AD2
         #define  SAD2RL_RLU   0x00
         #define  SAD2RL_AGND  0x01
         #define  SAD2RL_PB3   0x02
         #define  SAD2RL_PB5   0x03

#define  HY3131_R28  0x28
         //SAD1RH<2:0>:The positive reference signal of AD1
         #define  SAD1RH_FB    0x00
         #define  SAD1RH_REFO  0x10
         #define  SAD1RH_VREF  0x20
         #define  SAD1RH_PB6   0x30
         #define  SAD1RH_RLU   0x40
         #define  SAD1RH_VDD   0x50
         #define  SAD1RH_AGND  0x60

         //SAD1RL<2:0>:The negative reference signal of AD1
         #define  SAD1RL_RLU   0x00
         #define  SAD1RL_AGND  0x01
         #define  SAD1RL_PB3   0x02
         #define  SAD1RL_PB5   0x03
         #define  SAD1RL_FB    0x04
         #define  SAD1RL_VSS   0x05
         #define  SAD1RL_VREF  0x06

#define  HY3131_R29  0x29
         //Register bit that can Enable RMS Converter. 1=Enable; 0=Disable and clear RMS<37:0> as 0.
         #define  ENRMS        0x80

         //Register bit that can Enable Low Pass Filter. 1=Enable; 0=Disable and clear LPF<18:0> as 0.
         #define  ENLPF        0x40

         //LPFBW<2:0>:Register bit that can configure Over Sampling Ratio (OSR4) of Low Pass Filter.
         //Low Pass Filter data output rate=data input rate/OSR4.
         #define  LPFBW_128    0x00
         #define  LPFBW_256    0x08
         #define  LPFBW_512    0x10
         #define  LPFBW_1024   0x18
         #define  LPFBW_2048   0x20
         #define  LPFBW_4096   0x28
         #define  LPFBW_8192   0x30
         #define  LPFBW_16384  0x38

         //Register bit that can Enable Peak Hold.
         //1=Enable; 0=Disable and clear PKHMAX<18:0> as 40000h, PKHMIN<18:0> as 3FFFFh.
         #define  ENPKH        0x04

