temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/HY3131_Reg.h
         //PKHSEL<1:0>:Register bit that can select Peak Hold input to be AD1<23:5>, AD2<18:0> or LPF<18:0>.
         #define  PKHSEL_AD2   0x00 //AD2<18:0>
         #define  PKHSEL_AD1   0x01 //AD1<23:5>
         #define  PKHSEL_LPF   0x02 //LPF<18:0>
         //#define  PKHSEL_LPF   0x03 //LPF<18:0>

#define  HY3131_R2A  0x2A
         #define  PS1 0x80  //PS1?GPA<1> power select control bit
         #define  DS1 0x40  //DS1?GPA<1> OP3 output select control bit
         #define  FS1 0x20  //FS1?GPA<1> Feedback select control bit
         #define  SS1 0x10  //SS1?GPA<1> Sense end select control bit
         #define  PS0 0x08  //PS0?GPA<0> power select control bit
         #define  DS0 0x04  //DS0?GPA<0> OP3 output select control bit
         #define  FS0 0x02  //FS0?GPA<0> Feedback select control bit
         #define  SS0 0x01  //SS0?GPA<0> Sense end select control bit

#define  HY3131_R2B  0x2B
         #define  PS3 0x80  //PS3?GPA<3> power select control bit
         #define  DS3 0x40  //DS3?GPA<3> OP3 output select control bit
         #define  FS3 0x20  //FS3?GPA<3> Feedback select control bit
         #define  SS3 0x10  //SS3?GPA<3> Sense end select control bit
         #define  PS2 0x08  //PS2?GPA<2> power select control bit
         #define  DS2 0x04  //DS2?GPA<2> OP3 output select control bit
         #define  FS2 0x02  //FS2?GPA<2> Feedback select control bit
         #define  SS2 0x01  //SS2?GPA<2> Sense end select control bit

#define  HY3131_R2C  0x2C
         #define  PS5 0x80  //PS5?GPA<5> power select control bit
         #define  DS5 0x40  //DS5?GPA<5> OP3 output select control bit
         #define  FS5 0x20  //FS5?GPA<5> Feedback select control bit
         #define  SS5 0x10  //SS5?GPA<5> Sense end select control bit
         #define  PS4 0x08  //PS4?GPA<4> power select control bit
         #define  DS4 0x04  //DS4?GPA<4> OP3 output select control bit
         #define  FS4 0x02  //FS4?GPA<4> Feedback select control bit
         #define  SS4 0x01  //SS4?GPA<4> Sense end select control bit

#define  HY3131_R2D  0x2D
         #define  PS7 0x80  //PS7?GPA<7> power select control bit
         #define  DS7 0x40  //DS7?GPA<7> OP3 output select control bit
         #define  FS7 0x20  //FS7?GPA<7> Feedback select control bit
         #define  SS7 0x10  //SS7?GPA<7> Sense end select control bit
         #define  PS6 0x08  //PS6?GPA<6> power select control bit
         #define  DS6 0x04  //DS6?GPA<6> OP3 output select control bit
         #define  FS6 0x02  //FS6?GPA<6> Feedback select control bit
         #define  SS6 0x01  //SS6?GPA<6> Sense end select control bit

#define  HY3131_R2E  0x2E
         #define  PS9 0x80  //PS9?GPA<9> power select control bit
         #define  DS9 0x40  //DS9?GPA<9> OP3 output select control bit
         #define  FS9 0x20  //FS9?GPA<9> Feedback select control bit
         #define  SS9 0x10  //SS9?GPA<9> Sense end select control bit
         #define  PS8 0x08  //PS8?GPA<8> power select control bit
         #define  DS8 0x04  //DS8?GPA<8> OP3 output select control bit
         #define  FS8 0x02  //FS8?GPA<8> Feedback select control bit
         #define  SS8 0x01  //SS8?GPA<8> Sense end select control bit

#define  HY3131_R2F  0x2F
         //Register bit that can enable Voltage Reference Generator1. 1=Enable?A0=Disable.
         #define  ENVS     0x80

         //SMODE<6:0>
         #define  SMODE6   0x40 //Reserve
         #define  SMODE5   0x20 //SMODE5:Register bit SMODE<5> can connect RLU and AGND pin.
         #define  RLU_AGND SMODE5
         #define  SMODE4   0x10 //SMODE4:Register bit SMODE<4> can connect RLU and RLD pin.
         #define  RLU_RLD  SMODE4
         #define  SMODE3   0x08
         #define  SMODE2   0x04
         #define  SMODE1   0x02
         #define  SMODE0   0x01

         //SMODE Setting Application
         #define  PCC_Source  0x06 //00000110:Positive Constant Current Source
         #define  NCC_Source  0x07 //00000111:Negative Constant Current Source
         #define  CAP_CC_MODE 0x0F //0000111x:Capacitor measurement Constant Current Source
         #define  AGND_Source 0x11 //00000001:AGND Source
         #define  VDD_Source  0x12 //00000010:VDD Source
         #define  VSS_Source  0x13 //00000011:VSS Source
         #define  PCV_Source  0x14 //00010100:Positive Constant Voltage Source
         #define  NCV_Source  0x15 //00010101:Negative Constant Voltage Source
         #define  CAP_CV_MODE 0x1A //0001101x:Capacitor measurement Constant Voltage Source

#define  HY3131_R30  0x30
         //Register bit that can select input source of REFO Buffer.
         #define  SREFO_PB6 0x80 //1: select PB<6> pin.
         #define  SREFO_Int 0x00 //0: select relative AGND 1.2V voltage of the internal Band gap;

         //ACC<6:0>:Capacitor array can compensate ACV measurement bandwidth; the capacitance value is shown in the
         //above graph. The capacitance value is controlled by register bit ACC<6:0>.

#define  HY3131_R31  0x31
         //Register bit that can enable approximately 1.2V voltage of relative AGND of the internal Band gap
         //Voltage Reference and can enable REFO Buffer. 1=Enable, 0=Disable. When it is set 0, REFO pin is in Floating status.
         #define  ENREFO       0x80

         //Register bit that can enable bias circuit, providing bias for all analog circuit. 1=Enable, 0=Disable.
         #define  ENBIAS       0x40

         //SAGND<1:0>:AGND pin voltage select
         #define  SAGND_0P5    0x00 //00:AGND=0.5xVDD
         #define  SAGND_0P3    0x10 //01:AGND=0.3xVDD
         #define  SAGND_0P1    0x20 //10:AGND=0.1xVDD
         #define  SAGND_Dis    0x30 //11:Disable AGND Generator, AGND pin is in Floating status

         //SFUVR<3:0>:VREF voltage selection
         #define  SFUVR_VDS17  0x00
         #define  SFUVR_VDS16  0x01
         #define  SFUVR_VDS15  0x02
         #define  SFUVR_AGNDP9 0x03
         #define  SFUVR_AGNDP8 0x04
         #define  SFUVR_AGNDP7 0x05
         #define  SFUVR_AGNDP6 0x06
         #define  SFUVR_AGNDP0 0x07
         #define  SFUVR_VDS1   0x08
         #define  SFUVR_VDS2   0x09
         #define  SFUVR_VDS3   0x0A
         #define  SFUVR_AGNDN9 0x0B
         #define  SFUVR_AGNDN8 0x0C
         #define  SFUVR_AGNDN7 0x0D
         #define  SFUVR_AGNDN6 0x0E
         #define  SFUVR_PB7    0x0F

#define  HY3131_R32  0x32
         //Enable OP2 respectively
         #define  ENOP2       0x80

         //SOP2P<2:0>:OP2 Positive Input
         #define  SOP2P_SENSE 0x00
         #define  SOP2P_FB    0x10
         #define  SOP2P_RLU   0x20
         #define  SOP2P_AGND  0x30
         #define  SOP2P_PB0   0x40
         #define  SOP2P_PB1   0x50
         #define  SOP2P_PB2   0x60
         #define  SOP2P_PB3   0x70

         //Enable OP1 respectively
         #define  ENOP1       0x08

         //SOP1P<2:0>:OP1 Positive Input
         #define  SOP1P_SENSE 0x00
         #define  SOP1P_FB    0x01
         #define  SOP1P_RLU   0x02
         #define  SOP1P_AGND  0x03
         #define  SOP1P_PB0   0x04
         #define  SOP1P_PB1   0x05
         #define  SOP1P_PB2   0x06
         #define  SOP1P_PB8   0x07

