temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/HY3131_Reg.h
#define  HY3131_R33  0x33
         //OP1CHOP<1:0>:The chopper clock of OP1
         #define  CHOP_CLK0   0x00 //0
         #define  CHOP_CLK1k  0x40 //1k Hz square wave
         #define  CHOP_CLK2k  0x80 //2k Hz Square wave
         #define  CHOP_CLK1   0xC0 //1

         //Register bit that can enable Crystal Oscillator. 1=Enable; 0=Disable.
         #define  ENOSC     0x20

         //Register bit that can select system clock. SYSCLK. 0:SYSCLK=Crystal Oscillator output?F1:SYSCLK =XIN.
         #define  ENXI      0x10

         //SFT1<1:0>:Register bit that can select filter resistor as 100K, 10K, 0 or nil, as shown in the above graph.
         #define  SFT1_100K 0x00
         #define  SFT1_10K  0x04
         #define  SFT1_0    0x08
         #define  SFT1_nil  0x0C

         //SAD1I<1:0>:The input signal of AD1
         #define  SAD1I_AD1FP_AD1FN 0x00 //AD1IP:AD1FP,  AD1IN:AD1FN
         #define  SAD1I_FB_RLU      0x01 //AD1IP:FB,  AD1IN:RLU
         #define  SAD1I_TS1P_TS2N   0x02 //AD1IP:TS1P,  AD1IN:TS2N
         #define  SAD1I_TS1N_TS2P   0x03 //AD1IP:TS1N,  AD1IN:TS2P

#define  HY3131_R37  0x37 //Testing Mode, Don't use or Write "0" only

//------------------------------------------------------------------------------
#define  ReadComm  0x01
#define  WriteComm 0x00


#define  BIT0 0x01
#define  BIT1 0x02
#define  BIT2 0x04
#define  BIT3 0x08
#define  BIT4 0x10
#define  BIT5 0x20
#define  BIT6 0x40
#define  BIT7 0x80

#define C_func_KEY			(1 << 0)	//PT1.1
#define C_range_KEY         (1 << 1)	//PT1.0
#define C_Cal_KEY			0xFF
//FunCode
#define  E_DCVolt  0
#define  E_ACVolt  1
#define  E_DCmVolt 2
#define  E_ACmVolt 3
#define  E_OHMCV   4
#define  E_OHMCC   5
#define  E_OHM     6
#define  E_DCuA    7
#define  E_DCmA    8
#define  E_DCA     9
#define  E_ACuA    10
#define  E_ACmA    11
#define  E_ACA     12
#define  E_Temp    13
#define  E_CapCV   14
#define  E_CapCC   15
#define  E_Freq    16
#define  E_Diode   17
#define  E_Continuity 18
#define  E_CAP     19

//NowFunc_temp
#define  Func_DCV	0
#define  Func_ACV	1
#define  Func_DCmV  2
#define  Func_ACmV  3
#define  Func_OHM   4
#define  Func_uA    5	//Func_DCuA,Func_ACuA
#define  Func_mA    6	//Func_DCmA,Func_ACmA
#define  Func_A     7	//Func_DCA,Func_ACA
#define  Func_Hz    8
#define  Func_Cap   9
#define  Func_C_D   10

//Flash Data Calibration parameters
#define	Cal_DC60mV	0xAFC00	
#define	Cal_DC600mV	0xAFC04
#define	Cal_DC6V	0xAFC08
#define	Cal_DC60V	0xAFC0C
#define	Cal_DC600V	0xAFC10
#define	Cal_DC1000V	0xAFC14
#define	Cal_AC60mV	0xAFC18
#define	Cal_AC600mV	0xAFC1C
#define	Cal_AC6V	0xAFC20
#define	Cal_AC60V	0xAFC24
#define	Cal_AC600V	0xAFC28
#define	Cal_AC1000V	0xAFC2C
#define	cal_60R		0xAFC30
#define	cal_600R	0xAFC34
#define	cal_6KR		0xAFC38
#define	cal_60KR	0xAFC3C
#define	cal_600KR	0xAFC40
#define	cal_6MR		0xAFC44
#define	cal_60MR	0xAFC48
#define	cal_DC60uA	0xAFC4C
#define	cal_DC600uA	0xAFC50
#define	cal_DC60mA	0xAFC54
#define	cal_DC600mA	0xAFC58
#define	cal_DC6A	0xAFC5C
#define	cal_DC10A	0xAFC60
#define	cal_AC60uA	0xAFC64
#define	cal_AC600uA	0xAFC68
#define	cal_AC60mA	0xAFC6C
#define	cal_AC600mA	0xAFC70
#define	cal_AC6A	0xAFC74
#define	cal_AC10A	0xAFC78
#define cal_60nF	0xAFC7C
#define cal_600nF	0xAFC80
#define cal_6uF		0xAFC84
#define cal_60uF	0xAFC88
#define cal_600uF	0xAFC8C
#define cal_6mF		0xAFC90

// > 6000,向上換檔 6000
#define	C_upLimit	6000
// < 570, 向下跳檔 6000*0.095=570
#define C_downLimit	570

#define C_beepon_OHM 500	//50 ohm
#define C_beepOff_OHM 1100	//110 ohm


// TMA : 31.25ms
#define C_125ms	4
#define C_250ms	8
#define C_500ms	16
#define	C_1S	32 //1000ms / 31.25ms = 32
#define	Cap_1S	5 
#define C_2S	64 
#define C_3S	128 



typedef union _MCUSTATUS
{
  char  _byte;
  struct
  {
    unsigned b_ADCdone:1;
    unsigned b_TMAdone:1;
    unsigned b_TMBdone:1;
    unsigned b_TMCdone:1;
    unsigned b_RTCdone:1;
    unsigned b_UART_TxDone:1;
    unsigned b_UART_RxDone:1;
    unsigned b_UartConn:1;
  };
} MCUSTATUS;

typedef union _DMMSTATUS
{
  char  _byte;
  struct
  {
    unsigned b_RangeChange:1;
    unsigned b_FunChange:1;
	unsigned b_ScanTime:1;
	unsigned b_Cal_Mode:1;
	unsigned b_Cal_STATUS:1;
    unsigned RESV:3;
  };
} DMMSTATUS;

typedef struct
{
  	unsigned char b_longKeyEn:1;
  	unsigned char b_longKey:1;
  	unsigned char b_AutoEn:1;
  	unsigned char RESV1:5;

} KEY_STATUS; 

typedef struct
{
	unsigned char b_tick:1;
	unsigned char b_tma1SArrive:1;
    unsigned char b_delayClock:1;
	unsigned char b_freqTimeOut:1;
	unsigned char RESV2:4;	
} TIME_BASE; 

typedef union
{
	long adcVal;
	struct
	{
		char adcL;
		char adcH;
		char adcU;
		char adcUU;
	};
    struct
    {
        unsigned char rmsL;
        unsigned char rmsH;
        unsigned char rmsU;
        unsigned char rmsUU;
    };
}TYPE_ADC_DATA;

MCUSTATUS  	MCUSTATUSbits;
DMMSTATUS  	DMMSTATUSbits;
TIME_BASE	TSTATUS;
KEY_STATUS	KSTATUS;
//TYPE_flag	flag;

/******************************************************************************
  END
 ******************************************************************************/
